# 公众号配置
# 公众号appId
app_id = "wxa33b95132d47188a"
# 公众号appSecret
app_secret = "fea7407dd5d9d22fc20b45454eb1f0dd"
# 模板消息id
# 每日消息
template_id1 = "zql95bm-6ftewTVeRMnKXSPI4IrdvpRigb46DMcMax4"
# 课程消息,上课提醒
template_id2 = "WeOBMW7Pmfj3HkDGNCdSahq0vppHbmhyVgYYeVYFlX8"
# 晚安心语
template_id3 = "tMOdxSp_irXHm2UKkvCVcwGJwe67kxxqhWWlRv0KEak"
# 接收公众号消息的微信号
# 这是openid
user = ["oeNR16pIP8l19ew5SmkZf2Q_9xYU"]

# 信息配置
# 所在省份
province = "河北"
# 所在城市
city = "廊坊"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如2000-1-1，---------倒计时
birthday = "2003-6-11"
# 放假日期，格式同上------------计时器
love_date = "2023-9-30"
# 天行数据晚安心语 key
good_Night_Key = "54fe6df362d09cf85fc29d6dc48aa69b"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2023
month = 9
day = 18
# 每日推送时间
post_Time = "06:35:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:00:00", "10:00:00", "13:00:00", "16:00:00""]
# 课程时间
course_Time = ["8:00--9:40", "10:20--12:00", "14:00--15:40", "16:20--18:00"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:55:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {

    "2": [
            ['电气控制与PLC@教8-601', '供配电技术@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "3": [
            ['电气控制与PLC@教8-601', '传感器原理及应用@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','电力电子技术@教8-601', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
       "4": [
            ['电气控制与PLC@教8-601', '供配电技术@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "5": [
            ['电气控制与PLC@教8-601', '传感器原理及应用@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','电力电子技术@教8-601', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "6": [
            ['电气控制与PLC@教8-601', '供配电技术@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "7": [
            ['电气控制与PLC@教8-601', '传感器原理及应用@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','电力电子技术@教8-601', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "8": [
            ['电气控制与PLC@教8-601', '供配电技术@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "9": [
            ['电气控制与PLC@教8-601', '传感器原理及应用@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','电力电子技术@教8-601', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "10": [
            ['电气控制与PLC@教8-601', '供配电技术@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "11": [
            ['电气控制与PLC@教8-601', '传感器原理及应用@教8-601', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['传感器原理及应用@教8-601', '电气控制与PLC@教8-601', '', ''],
            ['供配电技术@教8-601', '自动控制原理@教8-601','电力电子技术@教8-601', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "12": [
            ['电气控制与PLC@教8-601', '', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['', '电气控制与PLC@教8-601', '', ''],
            ['', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', '形式与政策@教8-404'],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "13": [
           ['电气控制与PLC@教8-601', '', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['', '电气控制与PLC@教8-601', '', ''],
            ['', '自动控制原理@教8-601','电力电子技术@教8-601', '形式与政策@教8-404'],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "14": [
            ['电气控制与PLC@教8-601', '', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['', '电气控制与PLC@教8-601', '', ''],
            ['', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', '形式与政策@教8-404'],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
         "15": [
           ['', '', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['', '', '', ''],
            ['', '自动控制原理@教8-601','电力电子技术@教8-601', '形式与政策@教8-404'],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
              "16": [
           ['', '', '沟通与写作@教8-224', ''],
            ['自动控制原理@教8-601', '单片机原理及接口技术@教8-717','', ''],
            ['创业基础@教8-224', '电力电子技术@教8-601', '', ''],
            ['', '', '', ''],
            ['', '自动控制原理@教8-601','单片机原理及接口技术@教8-717', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ], 
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是爱情的第: {{love_day.DATA}} 天
# 距离生日还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
